#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.commons.azurerm_cosmosdb_sql_container.subscription_history will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "subscription_history" {
        id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db/containers/subscription-history"
        name                  = "subscription-history"
        # (6 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          + excluded_path {
              + path = "/"_etag"/?"
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

  # module.commons.module.subscription_requests_event_hub.azurerm_eventhub.events["ts-trial-subscription-requests"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 90
      + name                = "ts-trial-subscription-requests"
      + namespace_name      = "ts-trial-evh-trial-system"
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = "ts-p-itn-data-rg-01"
      + status              = "Active"
    }

  # module.commons.module.subscription_requests_event_hub.azurerm_eventhub_namespace.this will be created
  + resource "azurerm_eventhub_namespace" "this" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "italynorth"
      + maximum_throughput_units                  = (known after apply)
      + minimum_tls_version                       = "1.2"
      + name                                      = "ts-trial-evh-trial-system"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = false
      + resource_group_name                       = "ts-p-itn-data-rg-01"
      + sku                                       = "Standard"
      + tags                                      = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
      + zone_redundant                            = true
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.commons.module.key_vault.azurerm_monitor_diagnostic_setting.key_vault,
  on .terraform/modules/commons.key_vault/key_vault/main.tf line 55, in resource "azurerm_monitor_diagnostic_setting" "key_vault":
  55: resource "azurerm_monitor_diagnostic_setting" "key_vault" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
